Revit 2026 API

# SculptingFailures Properties

---

The BuiltInFailuresSculptingFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FaceSculptEditFailed | Face Sculpt Edit failed. |
|  | FaceSculptingFaceLoss | The original sculpted face is lost. |

#### Reference

BuiltInFailuresSculptingFailures Class

Autodesk.Revit.DB Namespace